read_verilog comp.v
synth -top comp

flatten

dfflibmap -liberty /home/lucid/OpenROAD-flow-scripts/flow/platforms/nangate45/lib/NangateOpenCellLibrary_typical.lib
abc -liberty /home/lucid/OpenROAD-flow-scripts/flow/platforms/nangate45/lib/NangateOpenCellLibrary_typical.lib

opt_clean
write_verilog synthesized_design.v

show
